cases/Biofilm_growth/multi_pores/mum/cyclic-mum-5e-6/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


transportModel  Newtonian;

muf         muf     	 [1 -1 -1 0 0 0 0 ] 1.2e-5;
//R            R           [0 1 -1 0 0 0 0] 1e-5;
//rhos        rhos         [1 -3 0 0 0 0 0] 2000;
rhof        rhof         [1 -3 0 0 0 0 0] 1000;
D           D            [0 2 -1 0 0 0 0]  1.6e-9;
//Db           Db            [0 2 -1 0 0 0 0]  0.00001;
//kd           kd            [0 0 -1 0 0 0 0]  0.01;
//psi         psi          [-1 1 2 0 0 0 0]  1;
//Weqbeta         Weqbeta          [0 0 0 0 0 0 0]  0.27;
//alphabeta0         alphabeta0          [0 0 -1 0 0 0 0]  100;

//kmax        kmax         [0 0 -1 0 0 0 0] 4.6;
//Y           Y            [0 0 0 0 0 0 0] 0.35;
//k1          k1            [1 -3 0 0 0 0 0] 0.55;
Mmax          Mmax         [1 -3 0 0 0 0 0] 5;
ks            ks          [1 -3 0 0 0 0 0] 3.5e-5;
ms            ms          [0 0 -1 0 0 0 0] 3e-5;
mum           mum         [0 0 -1 0 0 0 0] 5e-6;
Yxs           Yxs          [0 0 0 0 0 0 0]  4.5e-3;
ops           ops           [0 0 0 0 0 0 0] 1e-5;
C0            C0          [1 -3 0 0 0 0 0] 4e-3;
a             a            [0 0 0 0 0 0 0] 4;
b            b           [0 0 0 0 0 0 0] 4;
c            c           [0 2 -1 0 0 0 0] 1;
d            d            [0 0 1 0 0 0 0] 1;
rhoMb        rhoMb       [0 0 0 0 0 0 0] 560;
// ************************************************************************* //
